In [1]:
import pandas as pd
import numpy as np
import sklearn.ensemble
import lime.lime_tabular_mod
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split

import importlib
importlib.reload(lime.lime_tabular_mod)

pd.set_option("display.max_columns", None)
pd.set_option("mode.chained_assignment", None)
plt.style.use({"figure.facecolor": "white"})

### Load Titanic dataset

In [2]:
data = pd.read_csv("../data/titanic/train.csv").set_index("PassengerId")
data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [17]:
data["SibSp"].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [20]:
preprocessed_data = data.drop(columns=["Name", "Ticket"])
preprocessed_data["cabin_level"] = data["Cabin"].str[0].fillna("N/A")
preprocessed_data.drop(columns=["Cabin"], inplace=True)
preprocessed_data["Embarked"] = preprocessed_data["Embarked"].fillna("N/A")
preprocessed_data["Age"] = preprocessed_data["Age"].fillna(preprocessed_data["Age"].mean())


train, test = train_test_split(preprocessed_data, test_size=0.1)
train_labels = train["Survived"]
train.drop(columns="Survived", inplace=True)
test_labels = test["Survived"]
test.drop(columns="Survived", inplace=True)
train

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,cabin_level
PassengerId,,,,,,,,
427,2,female,28.000000,1,0,26.0000,S,N/A
599,3,male,29.699118,0,0,7.2250,C,N/A
644,3,male,29.699118,0,0,56.4958,S,N/A
185,3,female,4.000000,0,2,22.0250,S,N/A
530,2,male,23.000000,2,1,11.5000,S,N/A
...,...,...,...,...,...,...,...,...
550,2,male,8.000000,1,1,36.7500,S,N/A
57,2,female,21.000000,0,0,10.5000,S,N/A
319,1,female,31.000000,0,2,164.8667,S,C
634,1,male,29.699118,0,0,0.0000,S,N/A
795,3,male,25.000000,0,0,7.8958,S,N/A

In [21]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 801 entries, 427 to 795
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Pclass       801 non-null    int64
 1   Sex          801 non-null    object
 2   Age          801 non-null    float64
 3   SibSp        801 non-null    int64
 4   Parch        801 non-null    int64
 5   Fare         801 non-null    float64
 6   Embarked     801 non-null    object
 7   cabin_level  801 non-null    object
dtypes: float64(2), int64(3), object(3)
memory usage: 56.3+ KB

### Load Avocado dataset